cask_args appdir: '/Applications'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'
tap 'cantino/mcfly'

# brews
brew 'bat'
brew 'bash-completion'
brew 'diffr' # better diffing tool, used in git config
brew 'git'
brew 'gh' # GitHub's CLI tool
brew 'gnupg2'
brew 'gping' # graphical ping
brew 'jql' # JSON tool, inspired by `jq`
brew 'lima' # macOS containerd/nerdctl (alternative to Docker Desktop, somewhat)
brew 'mcfly' # History tool
brew 'mmv' # multi-move
brew 'nebula' # overlay network tool built on the Noise Protocol. Similar to TailScale
brew 'postgresql', restart_service: true
brew 'procs' # modern replacement for ps, not backwards compatible
brew 'reattach-to-user-namespace'
brew 'ripgrep' # grep, ack, ag (Silver Searcher) alternative but faster and better. `rg` is the command
brew 'scrcopy' # Display and control your Android device. Vital for Android or demoing something over screenshare on a physical android
brew 'stow' # a symlink "farm manager". Most package/version/dotfile managers do something similar, but stow is generic
brew 'tesseract' # Optical Character Recognition (OCR) CLI
brew 'tldr' # community maintained TL;DR for CLI tools. My *favorite* tool. It's amazing
brew 'tmux' # used to fix pbcopy/pbpaste in older Apple (pre-2017), or non-Apple versions of tmux, or pre-built, non-GUI versions of VIM
brew 'unixodbc'
brew 'wrk' # multi-threaded HTTP benchmarking tool
brew 'xh' # curl/wget alternative. 2nd favorite tool.
brew 'xz' # compress/decompress .xz format


# TODO - determine way to install 'asdf' version manager
brew 'coreutils'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'libxslt'
brew 'libtool'

# casks
cask 'atom'
cask 'brave-browser'
cask 'dash'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'fantastical'
cask 'font-sauce-code-pro-nerd-font'
# cask 'font-source-code-pro-for-powerline'
cask 'gimp'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2'
cask 'mailspring'
cask 'postman'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'telegram'
cask 'visual-studio-code'
cask 'zsa-wally' #ergodox-ex keyboard flashing tool

# mac app store installs
mas 'todoist-to-do-list-tasks', id: 585829637
