tap "cantino/mcfly"
tap "elixir-tools/tap"
tap "superfly/tap"
tap "ycd/tap"

# brews
brew "bat"
brew "bash-completion"
brew "diffr" # better diffing tool, used in git config
brew "fzf" # Fuzzy-finder
brew "git"
brew "gh" # GitHub's CLI tool
brew "gnupg2"
brew "gping" # graphical ping
brew "jql" # JSON tool, inspired by `jq`
brew "lima" # macOS containerd/nerdctl (alternative to Docker Desktop, somewhat)
brew "lsd" # colorful clone of ls
brew "mcfly" # History tool
brew "mmv" # multi-move
brew "nebula" # overlay network tool built on the Noise Protocol. Similar to TailScale
brew "postgresql", restart_service: true
brew "procs" # modern replacement for ps, not backwards compatible
brew "reattach-to-user-namespace"
brew "ripgrep" # grep, ack, ag (Silver Searcher) alternative but faster and better. `rg` is the command
brew "scrcpy" # Display and control your Android device. Vital for Android or demoing something over screenshare on a physical android
brew "sslscan" # Check SSL/TLS services for supported cipher suites
brew "starship" # Cross-shell prompt, instead of Powerlevel10k or others
brew "tesseract" # Optical Character Recognition (OCR) CLI
brew "tlrc" # community maintained TL;DR for CLI tools. My *favorite* tool. It's amazing (Rust client)
brew "tmux" # used to fix pbcopy/pbpaste in older Apple (pre-2017), or non-Apple versions of tmux, or pre-built, non-GUI versions of VIM
brew "unixodbc"
brew "wrk" # multi-threaded HTTP benchmarking tool
brew "xh" # curl/wget alternative. 2nd favorite tool.
brew "xz" # compress/decompress .xz format
brew "zsh"

brew "elixir-tools/tap/next-ls"
brew "superfly/tap/flyctl" # Fly.io's CLI
brew "ycd/tap/dstp" # Common networking tests



# TODO - determine way to install 'asdf' version manager
brew "coreutils"
brew "automake"
brew "autoconf"
brew "openssl"
brew "libyaml"
brew "readline"
brew "libxslt"
brew "libtool"

# casks
cask "android-platform-tools"
cask "chromedriver"
cask "copyq"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "fantastical"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "gimp"
cask "google-drive"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "mailspring"
cask "postman"
cask "raycast"
cask "rectangle-pro"
cask "responsively"
cask "slack"
cask "spotify"
cask "sqlectron"
cask "steam"
cask "telegram"
cask "visual-studio-code"
cask "warp"

# mac app store installs

# vscode extensions
vscode "42Crunch.vscode-openapi" # Swagger Editor
vscode "aaron-bond.better-comments" # Annotate/Color TODOs
vscode "alexanderbast.vscode-snazzy" # Colors/Themes
vscode "aliariff.auto-add-brackets"
vscode "attilabuti.mustache-syntax-vscode"
vscode "bierner.markdown-preview-github-styles"
vscode "bmarkovic.haproxy"
vscode "bradlc.vscode-tailwindcss"
vscode "csstools.postcss"
vscode "eamodio.gitlens"
vscode "elixir-tools.elixir-tools"
vscode "file-icons.file-icons"
vscode "florinpatrascu.vscode-elixir-snippets"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "JakeBecker.elixir-ls"
vscode "jock.svg"
vscode "lexical-lsp.lexical"
vscode "liviuschera.noctis" # Colors/Themes
vscode "mechatroner.rainbow-csv"
vscode "mermade.openapi-lint"
vscode "mjmlio.vscode-mjml"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server" # Runs a simple web server
vscode "ms-vsliveshare.vsliveshare"
vscode "msaraiva.surface"
vscode "mtxr.sqltools"
vscode "pgourlain.erlang"
vscode "phoenixframework.phoenix"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl" # Colors/Themes
vscode "swashata.beautiful-ui" # Colors/Themes
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "tomphilbin.gruvbox-themes" # Colors/Themes
vscode "william-voyek.vscode-nginx"
vscode "yzhang.markdown-all-in-one"
